---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ConduitSizes
source: html/5ed94151-bec3-985c-856e-cea52c2b1a2a.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizes

Class ConduitSizeSet being used to store the conduit sizes.

## Syntax (C#)
```csharp
public class ConduitSizes : IEnumerable<ConduitSize>,
	IDisposable
```